app/Http/Controllers/AcompanantesController.php

select * from `tiposId`
---
    public function create($id){
        $pacienteId = $id;
        $tiposId = TiposId::all();

select * from `tiposId`
select * from `acompanantes` where `id` = '1' limit 1
---
    public function edit($id){
        $tiposId = TiposId::all();
        $acompanante = Acompanantes::where('id', $id)->first();

update `acompanantes` set `edad` = '25', `mailAcom` = 'acom1@misena.edi.co', `nIdAcom` = '1014274505', `pApe` = 'Fonseca', `parPac` = 'Primo', `pNom` = 'Andresin', `sApe` = 'Mosquera', `sNom` = 'Felipin', `telAcom` = '4349952', `tipoId_id` = '2' where `id` = '1'
---
    public function update(Request $request){
        $input = $request->all();
        $acompanante = Acompanantes::where('id', $input["id"]);
        try {
            if($acompanante == null){
                Flash::error("Se ha producido un error al generar la vista");
                return redirect("/empresa/pacientes");
            }
            $acompanante->update([
                "edad" => $input["edad"],
                "mailAcom" => $input['email'],
                "nIdAcom" => $input["numeroId"],
                "pApe" => $input["primerApe"],
                "parPac" => $input['parentesco'],
                "pNom" => $input["primerNom"],
                "sApe" => $input["segundoApe"],
                "sNom" => $input["segundoNom"],
                "telAcom" => $input['telefono'],
                "tipoId_id" => $input["tipoId"],
            ]);