app/Http/Controllers/ConsultaController.php

    public function listar(){
        $citas = Citas::all();
---
select * from `citas`

    public function inicioConsulta($idCita){
        $citas = Citas::where('id', $idCita)->first();
        $insumos = Insumos::all();
---
select * from `citas` where `id` = '2' limit 1
select * from `insumos`