app/Http/Controllers/ConsultaController.php

select * from `citas`
---
    public function listar(){
        $citas = Citas::all();

select * from `citas` where `id` = '1' limit 1
---
    public function inicioConsulta($idCita){
        $citas = Citas::where('id', $idCita)->first();