app/Http/Controllers/EmpleadosController.php

    public function index(){
        if(Auth::user()->rol->nomRol == 'Administrador'){
            $empleados = Empleados::all();
---
select * from `empleados`

    public function view($id){
        $empleado = Empleados::where('id', $id)->first();
---
select * from `empleados` where `id` = '5' limit 1

    public function edit($id){
        $empleado = Empleados::where('id', $id)->first();
        $tiposId = TiposId::all();
        $epss = Eps::all();
        $arls = Arl::all();
        $cargos = Cargos::all();
---
select * from `empleados` where `id` = '5' limit 1
select * from `tiposId`
select * from `cargos`