app/Http/Controllers/HomeController.php

    public function index()
    {
        $categorias = count(Categorias::all());
        $insumos = count(Insumos::all());
        $empleados = count(Empleados::all());
        $pacientes = count(Pacientes::all());
        $usuarios = count(Usuarios::all());
        $sedes = count(Sedes::all());
---
select * from `insumos`
select * from `empleados`
select * from `pacientes`
select * from `sedes`