app/Http/Controllers/InsumosController.php

select * from `insumos`
select COUNT(*) as count from `insumos` group by categoria_id
---
    public function index(){
        $insumos = Insumos::all();
        $userData = Insumos::select(\DB::raw("COUNT(*) as count"))
                    ->groupBy(\DB::raw("categoria_id"))
                    ->pluck('count');

select * from `insumos`
---
    public function listar(){
        $insumos = Insumos::all();