app/Http/Controllers/PacientesController.php

    public function index(){
        if(Auth::user()->rol->nomRol == "Administrador"){
            $pacientes = Pacientes::all();
---
select * from `pacientes`

    public function view($id){
        $paciente = Pacientes::where('id', $id)->first();
---
select * from `pacientes` where `id` = '1' limit 1

    public function create() {
        $epss = Eps::all();
        $tiposId = TiposId::all();
---
select * from `tiposId`

    public function edit($id){
        $paciente = Pacientes::where('id', $id)->first();
        $tiposId = TiposId::all();
---
select * from `pacientes` where `id` = '2' limit 1
select * from `tiposId`

    public function update(Request $request){
        $input = $request->all();
        try {
            $paciente = Pacientes::where('id', $input['id']);
            if($paciente == null){
                Flash::error("Se ha producido un error al generar la vista");
                return redirect("/empresa/pacientes");
            }
            $paciente->update([
                "ciuRes" => $input['ciudad'],
                "dirRes" => $input['direccion'],
                "eCivil" => $input['estadoCivil'],
                "fecNac" => $input["fechaNac"],
                "genero" => $input["genero"],
                "mailPac" => $input['email'],
                "nIdPac" => $input["numeroId"],
                "pApe" => $input["primerApe"],
                "pNom" => $input["primerNom"],
                "regimen" => $input["regimen"],
                "rh" => $input['rh'],
                "sApe" => $input["segundoApe"],
                "sNom" => $input["segundoNom"],
                "telPac" => $input['telefono'],
                "eps_id" => $input['eps'],
                "tipoId_id" => $input["tipoId"]
            ]);
---
update `pacientes` set `ciuRes` = 'Bogotá', `dirRes` = 'Calle 64C #112A-20', `eCivil` = 'U', `fecNac` = '2018-04-10', `genero` = 'M', `mailPac` = 'affonseca605@misena.edu.co', `nIdPac` = '1014274506', `pApe` = 'Fonseca', `pNom` = 'Andres', `regimen` = 'S', `rh` = 'O+', `sApe` = 'Mosquera', `sNom` = 'Felipe', `telPac` = '4349951', `eps_id` = '1', `tipoId_id` = '2' where `id` = '1'