app/Http/Controllers/UsuariosController.php

    public function create(){
        $empleados = Empleados::all();
        $roles = Roles::all();
---
select * from `empleados`
select * from `roles`

    public function listar(Request $request){
        $usuarios = User::all();
---
select * from `users`